{
  "format": "layers-model",
  "generatedBy": "keras v3.13.2",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.13.2",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "VSL_Optimized_Model",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [
                null,
                128,
                128,
                3
              ],
              "batchInputShape": [
                null,
                128,
                128,
                3
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input",
              "optional": false
            },
            "name": "input",
            "inbound_nodes": []
          },
          {
            "class_name": "Rescaling",
            "config": {
              "name": "rescaling",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "scale": 0.00392156862745098,
              "offset": 0
            },
            "name": "rescaling",
            "inbound_nodes": [
              [
                [
                  "input",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1",
            "inbound_nodes": [
              [
                [
                  "rescaling",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "bn1",
            "inbound_nodes": [
              [
                [
                  "conv1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "activation": "relu"
            },
            "name": "activation",
            "inbound_nodes": [
              [
                [
                  "bn1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "pool1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "name": "pool1",
            "inbound_nodes": [
              [
                [
                  "activation",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2",
            "inbound_nodes": [
              [
                [
                  "pool1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "bn2",
            "inbound_nodes": [
              [
                [
                  "conv2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "activation": "relu"
            },
            "name": "activation_1",
            "inbound_nodes": [
              [
                [
                  "bn2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "pool2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "name": "pool2",
            "inbound_nodes": [
              [
                [
                  "activation_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv3",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 128,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv3",
            "inbound_nodes": [
              [
                [
                  "pool2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn3",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "bn3",
            "inbound_nodes": [
              [
                [
                  "conv3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "activation": "relu"
            },
            "name": "activation_2",
            "inbound_nodes": [
              [
                [
                  "bn3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "pool3",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "name": "pool3",
            "inbound_nodes": [
              [
                [
                  "activation_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "GlobalAveragePooling2D",
            "config": {
              "name": "global_pooling",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "data_format": "channels_last",
              "keepdims": false
            },
            "name": "global_pooling",
            "inbound_nodes": [
              [
                [
                  "pool3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "fc1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 256,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            },
            "name": "fc1",
            "inbound_nodes": [
              [
                [
                  "global_pooling",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.4,
              "seed": null,
              "noise_shape": null
            },
            "name": "dropout",
            "inbound_nodes": [
              [
                [
                  "fc1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "output",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 29,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            },
            "name": "output",
            "inbound_nodes": [
              [
                [
                  "dropout",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "input",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "output",
            0,
            0
          ]
        ]
      }
    },
    "training_config": {
      "loss": "sparse_categorical_crossentropy",
      "loss_weights": null,
      "metrics": [
        "accuracy"
      ],
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": true,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 0.0010000000474974513,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "bn1/gamma",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "bn1/beta",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "bn1/moving_mean",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "bn1/moving_variance",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "bn2/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "bn2/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "bn2/moving_mean",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "bn2/moving_variance",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "bn3/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "bn3/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "bn3/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "bn3/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1/kernel",
          "shape": [
            3,
            3,
            3,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2/kernel",
          "shape": [
            3,
            3,
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3/kernel",
          "shape": [
            3,
            3,
            64,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "fc1/kernel",
          "shape": [
            128,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "fc1/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "output/kernel",
          "shape": [
            256,
            29
          ],
          "dtype": "float32"
        },
        {
          "name": "output/bias",
          "shape": [
            29
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}